In [4]:
import numpy as np
import pandas as pd

In [5]:
## merge(birleştirmek, kaynaştırmak) kullanarak data frame leri birleştirebiliyoruz
## concat ile farkı data frame leri yan yana eklemesidir

In [6]:
mergeSozluk1 = {"Isim" : ["Ahmet", "Mehmet","Zeynep","Atıl"], "Spor" : ["Koşu","Yüzme", "Koşu","Basketbol"]}

In [7]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [8]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [9]:
mergeSozluk2 = {"Isim" : ["Ahmet", "Mehmet","Zeynep","Atıl"], "Kalori" : ["100","200", "250","150"]}

In [10]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [11]:
mergeDataFrame2

     Isim Kalori
0   Ahmet    100
1  Mehmet    200
2  Zeynep    250
3    Atıl    150

In [12]:
yeniDataFrame = pd.merge(mergeDataFrame1,mergeDataFrame2, on="Isim")

In [13]:
yeniDataFrame

     Isim       Spor Kalori
0   Ahmet       Koşu    100
1  Mehmet      Yüzme    200
2  Zeynep       Koşu    250
3    Atıl  Basketbol    150